runTestCases/initialCases/2_sqrDuct_Re=40000/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "0.0001/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    symmetry1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       7080;
    }
    symmetry2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          60;
        startFace       7140;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          120;
        startFace       7200;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3600;
        startFace       7320;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  right;
        separationVector (0.15 0 0);
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          3600;
        startFace       10920;
        matchTolerance  0.0001;
        transform       translational;
        neighbourPatch  left;
        separationVector (-0.15 0 0);
    }
)

// ************************************************************************* //
