runTestCases/initialCases/2_sqrDuct_Re=40000/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "1000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
3600
(
(0.000921706 1.61702e-21 5.9107e-21)
(0.00262603 3.48212e-20 1.00297e-19)
(0.00434591 -2.8543e-19 1.36148e-19)
(0.00611556 -8.47896e-19 1.99104e-19)
(0.00794616 -1.78398e-18 2.68246e-19)
(0.00983344 -3.17747e-18 3.26556e-19)
(0.0117582 -5.06451e-18 3.69025e-19)
(0.013689 -7.42374e-18 3.94202e-19)
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
