runTestCases/initialCases/2_sqrDuct_Re=40000/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3600
(
(0.075 -0.999 -0.999)
(0.075 -0.99693 -0.999)
(0.075 -0.994716 -0.999)
(0.075 -0.992348 -0.999)
(0.075 -0.989816 -0.999)
(0.075 -0.987108 -0.999)
(0.075 -0.984213 -0.999)
(0.075 -0.981118 -0.999)
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.075 -1 -0.02)
(0.075 -1 -0.0597753)
(0.075 -1 -0.0990586)
(0.075 -1 -0.137767)
(0.075 -1 -0.175822)
(0.075 -1 -0.213152)
(0.075 -1 -0.24969)
(0.075 -1 -0.285377)
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
