runTestCases/initialCases/2_sqrDuct_Re=40000/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
3600
(
6e-07
6.41865e-07
6.86565e-07
7.34279e-07
7.85197e-07
8.39517e-07
8.97447e-07
9.59206e-07
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
