runTestCases/initialCases/2_sqrDuct_Re=40000/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
3600
(
4000
4000
4000
4000
4000.01
4000.01
4000.01
4000.02
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetryPlane;
    }
    symmetry2
    {
        type            symmetryPlane;
    }
    wall
    {
        type            omegaWallFunction;
        blending        binomial;
        n               2;
        value           nonuniform List<scalar> 
120
(
4000.29
4000.29
4000.29
4000.29
4000.28
4000.28
4000.28
4000.28
...
)
;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
