runTestCases/initialCases/2_sqrDuct_Re=40000/system/sample_surface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a surface, specified by one point and a normal direction.

\*---------------------------------------------------------------------------*/

type            surfaces;
libs            (sampling);

interpolationScheme	cellPoint;

surfaceFormat   raw;

fields  (U turbulenceProperties:R nonlinearR);

surfaces
(
yzPlane
{
	type        plane;
	point		(0.075 0 0);
	normal	(1 0 0);
	interpolate  true;
}
) ;

// ************************************************************************* //
